app/controllers/users_controller.rb

  def delete_user
    username = params['username']
    if username
      User.find_by_username(username).delete
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'test1' LIMIT 1

  def users_list
    render json: { users: User.all }
---
SELECT `users`.* FROM `users`