app/controllers/users_controller.rb

  def create_user
    username = params['username']
    password = params['password']
    if username
      if User.find_by_username(username)
        render json: { reason: "username existed" }, status: "400"
        return
      end
    end
    if username && password
      user = User.create({ password: password, username: username })
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'test' LIMIT 1
INSERT INTO `users` (`created_at`, `updated_at`, `username`, `password`) VALUES ('2020-06-30 09:56:22', '2020-06-30 09:56:22', 'test', '123456')

  def delete_user
    id = params['id']
    if id
      user = User.find_by_id(id)
      if user
        user.delete
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 33 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 21

  def login
    username = params['username']
    password = params['password']
    if username && password
      if user = User.find_by_username(username)
        if Digest::SHA1.hexdigest(user.password) == password
          user.authed = true
          user.session_id = user.create_session
          user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'test1' LIMIT 1
UPDATE `users` SET `session_id` = 'e30dcf12a2d537d9d4f6f1d9c7cd64d3', `updated_at` = '2020-07-03 09:39:51' WHERE `users`.`id` = 29

  def users_list
    render json: { users: User.all }
---
SELECT `users`.* FROM `users`

  def logout
    user_id = params["userId"]
    if user = User.find_by_id(user_id)
      user.authed = false
      user.session_id = nil
      user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 31 LIMIT 1
UPDATE `users` SET `authed` = FALSE, `session_id` = '', `updated_at` = '2020-07-09 09:07:44' WHERE `users`.`id` = 31

  def auth_session
    session = params["session"]
    user = User.find_by_session_id(session)
---
SELECT  `users`.* FROM `users` WHERE `users`.`session_id` = '4ecf07d1696f63430a4d0d4df005e3a8' LIMIT 1