app/controllers/welcome_controller.rb

  def index
    @records = User.all
---
SELECT `users`.* FROM `users`